Prod's plan is a bit more complicated (as I was trying to roll out some changes when I found the anomaly):

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.epp.aws_iam_group_policy_attachment.read_become_biorxiv_role_attachment must be replaced
-/+ resource "aws_iam_group_policy_attachment" "read_become_biorxiv_role_attachment" {
      ~ id         = "epp-prod-developers-20230310154344216800000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::512686554592:policy/epp-prod-developers-become-access-biorxiv-xml-role" # forces replacement -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.epp.aws_iam_policy.become_biorxiv_role must be replaced
-/+ resource "aws_iam_policy" "become_biorxiv_role" {
      ~ arn       = "arn:aws:iam::512686554592:policy/epp-prod-developers-become-access-biorxiv-xml-role" -> (known after apply)
      ~ id        = "arn:aws:iam::512686554592:policy/epp-prod-developers-become-access-biorxiv-xml-role" -> (known after apply)
      ~ name      = "epp-prod-developers-become-access-biorxiv-xml-role" -> "epp-prod-become-access-biorxiv-xml-role" # forces replacement
      ~ policy_id = "ANPAXOXT77XQIOZAOVLXG" -> (known after apply)
        tags      = {
            "Environment" = "prod"
            "Project"     = "epp"
        }
        # (3 unchanged attributes hidden)
    }

  # module.epp.aws_iam_policy.read_biorxiv_bucket will be created
  + resource "aws_iam_policy" "read_biorxiv_bucket" {
      + arn         = (known after apply)
      + description = "EPP prod bioRxiv's S3 bucket access"
      + id          = (known after apply)
      + name        = "epp-prod-read-biorxiv-bucket"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:Get*",
                          + "s3:List*",
                          + "s3-object-lambda:Get*",
                          + "s3-object-lambda:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::transfers-elife",
                          + "arn:aws:s3:::transfers-elife/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Environment" = "prod"
          + "Project"     = "epp"
        }
      + tags_all    = {
          + "Environment" = "prod"
          + "Project"     = "epp"
        }
    }

  # module.epp.aws_iam_policy.read_only will be created
  + resource "aws_iam_policy" "read_only" {
      + arn         = (known after apply)
      + description = "EPP prod S3 bucket read-only access"
      + id          = (known after apply)
      + name        = "epp-prod-s3-read-only"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-elife-epp-data"
                      + Sid      = "List"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:GetObjectAttributes",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-elife-epp-data/*"
                      + Sid      = "AccessSubPaths"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Environment" = "prod"
          + "Project"     = "epp"
        }
      + tags_all    = {
          + "Environment" = "prod"
          + "Project"     = "epp"
        }
    }

  # module.epp.aws_iam_policy.read_only_data_prefix will be created
  + resource "aws_iam_policy" "read_only_data_prefix" {
      + arn         = (known after apply)
      + description = "EPP prod S3 bucket read-only access to /data"
      + id          = (known after apply)
      + name        = "epp-prod-s3-read-only-data-prefix"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-elife-epp-data"
                      + Sid      = "List"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:GetObjectAttributes",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prod-elife-epp-data/data/*"
                      + Sid      = "AccessSubPaths"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Environment" = "prod"
          + "Project"     = "epp"
        }
      + tags_all    = {
          + "Environment" = "prod"
          + "Project"     = "epp"
        }
    }

  # module.epp.aws_iam_policy.read_write will be updated in-place
  ~ resource "aws_iam_policy" "read_write" {
        id          = "arn:aws:iam::512686554592:policy/epp-prod-s3-read-write"
        name        = "epp-prod-s3-read-write"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = "s3:ListBucket" -> [
                          + "s3:ListBucket",
                        ]
                      ~ Sid      = "VisualEditor0" -> "List"
                        # (2 unchanged attributes hidden)
                    },
                  ~ {
                      ~ Action   = [
                          + "s3:DeleteObject",
                            "s3:PutObject",
                            "s3:GetObject",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:AbortMultipartUpload",
                            "s3:GetObjectAttributes",
                          - "s3:ListBucket",
                          - "s3:DeleteObject",
                            "s3:ListMultipartUploadParts",
                          + "s3:ListBucket",
                          + "s3:AbortMultipartUpload",
                          + "s3:ListBucketMultipartUploads",
                        ]
                      ~ Sid      = "VisualEditor1" -> "AccessSubPaths"
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {
            "Environment" = "prod"
            "Project"     = "epp"
        }
        # (5 unchanged attributes hidden)
    }

  # module.epp.aws_iam_role.epp_server_role will be created
  + resource "aws_iam_role" "epp_server_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/0108D0073AFB87B6669E378F0A9CFB76:sub" = "system:serviceaccount:epp--prod:epp-server"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::512686554592:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/0108D0073AFB87B6669E378F0A9CFB76"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "epp-prod-epp-server"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "Project"     = "epp"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "epp"
        }
      + unique_id             = (known after apply)
    }

  # module.epp.aws_iam_role.image_server_role will be created
  + resource "aws_iam_role" "image_server_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/0108D0073AFB87B6669E378F0A9CFB76:sub" = "system:serviceaccount:epp--prod:epp-image-server"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::512686554592:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/0108D0073AFB87B6669E378F0A9CFB76"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "epp-prod-image-server"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "Project"     = "epp"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "epp"
        }
      + unique_id             = (known after apply)
    }

  # module.epp.aws_iam_role.import_role will be created
  + resource "aws_iam_role" "import_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/0108D0073AFB87B6669E378F0A9CFB76:sub" = "system:serviceaccount:epp--prod:epp-import"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::512686554592:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/0108D0073AFB87B6669E378F0A9CFB76"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "epp-prod-import"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "prod"
          + "Project"     = "epp"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "epp"
        }
      + unique_id             = (known after apply)
    }

  # module.epp.aws_iam_role_policy_attachment.epp_server_read_only_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "epp_server_read_only_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "epp-prod-epp-server"
    }

  # module.epp.aws_iam_role_policy_attachment.image_server_read_only_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "image_server_read_only_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "epp-prod-image-server"
    }

  # module.epp.aws_iam_role_policy_attachment.import-role-biorxiv-access-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "import-role-biorxiv-access-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "epp-prod-import"
    }

  # module.epp.aws_iam_role_policy_attachment.import-role-s3-read-write-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "import-role-s3-read-write-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::512686554592:policy/epp-prod-s3-read-write"
      + role       = "epp-prod-import"
    }

  # module.epp.aws_s3_bucket.meca_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "meca_bucket" {
      + force_destroy               = false
        id                          = "prod-elife-epp-meca"
        tags                        = {
            "Environment" = "prod"
            "Project"     = "epp"
        }
        # (9 unchanged attributes hidden)

      - timeouts {}

        # (3 unchanged blocks hidden)
    }

  # module.epp.aws_s3_bucket.pdf_bucket will be updated in-place
  ~ resource "aws_s3_bucket" "pdf_bucket" {
      + force_destroy               = false
        id                          = "prod-elife-epp-pdf"
        tags                        = {
            "Environment" = "prod"
            "Project"     = "epp"
        }
        # (9 unchanged attributes hidden)

      - timeouts {}

        # (3 unchanged blocks hidden)
    }

Plan: 12 to add, 3 to change, 2 to destroy.
```

In Summary:
- rename one policy from `epp-prod-developers-become-access-biorxiv-xml-role` -> `epp-prod-become-access-biorxiv-xml-role`
- add policy to allow reading bioRxiv's bucket and attach to `epp-developers` group
- add policy to allow read-only to the EPP bucket and attach to a new role for `epp-image-server`
- add policy to allow read-only to `data/` prefix in EPP bucket and attach to a new role for `epp-server`
- Undo some changes to policy IDs made through the GUI editor on `epp-prod-s3-read-write` policy
- Create a new role for `epp-import` and attach read-biorxiv-bucket and read-write policy to it.